// WRITE SEEDS FOR RACES??? 

// USE THE ONE RACE BELOW FOR TESTING
[
    {
        "name": "Dwarf",
        "extra": "Darkvision:  you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray. Dwarven Combat Training: You have proficiency with the battleaxe, handaxe, light hammer, and warhammer. Dwarven Resilience. You have advantage on saving throws against poison, and you have resistance against poison damage.",
        "age": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.",
        "size": "Medium: Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
        "speed": "Speed: 25 ft. Your speed is not reduced by wearing heavy armor.",
        "special abilities": ["Tool Proficiency. You gain proficiency with the artisan's tools of your choice: Smith's tools, brewer's supplies, or mason's tools. Stonecunning: Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.", "arrayno2", "indexno3"],
        "languages": ["Common", "Dwarvish"],
        "stats": "Con +2"
    },
]

    // {
    //     "name": "Aarakocra",
    //     "age": "Aarakocra reach maturity by age 3. Compared to humans, aarakocra don't usually live longer than 30 years.",
    //     "alignment": " Most aarakocra are good and rarely choose sides when it comes to law and chaos. Tribal leaders and warriors might be lawful, while explorers and adventurers might tend toward chaotic.",
    //     "size": "Aarakocra are about 5 feet tall. They have thin, lightweight bodies that weigh between 80 and 100 pounds. Your size is Medium.",
    //     "abilities": "You have a flying speed of 50 feet. To use this speed, you can't be wearing medium or heavy armor. Your talons are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.",
    //     "languages": "You can speak, read, and write Common, Aarakocra, and Auran.",
    //     "stats": ""
    // },
    // {
    //     "name": "Dragonborn",
    //     "extra": "",
    //     "age": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.",
    //     "size": "Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.",
    //     "speed": "Speed: 30 ft.",
    //     "special abilities": "Draconic Ancestry: You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.
    //     Draconic Ancestry
    //     Dragon	    Damage Type	        Breath Weapon
    //     Black	    Acid	            5 by 30 ft. line (Dex. save)
    //     Blue	    Lightning	        5 by 30 ft. line (Dex. save)
    //     Brass	    Fire	            5 by 30 ft. line (Dex. save)
    //     Bronze	    Lightning	        5 by 30 ft. line (Dex. save)
    //     Copper	    Acid	            5 by 30 ft. line (Dex. save)
    //     Gold	    Fire	            15 ft. cone (Dex. save)
    //     Green	    Poison	            15 ft. cone (Con. save)
    //     Red	        Fire	            15 ft. cone (Dex. save)
    //     Silver	    Cold	            15 ft. cone (Con. save)
    //     White	    Cold	            15 ft. cone (Con. save)
    //     Breath Weapon: You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.
    //     When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.
    //     After you use your breath weapon, you can't use it again until you complete a short or long rest.
    //     Damage Resistance: You have resistance to the damage type associated with your draconic ancestry.",
    //     "languages": "You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants.",
    //     "stats": "Str +2, Cha + 1"
    // },

//     {
//         "name": "Dwarf (Hill)",
//         "extra": "",
//         "age": "", 
//         "size": "",
//         "speed": "",
//         "special abilities": "",
//         "languages": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak.",
//         "stats": "Con + 2, Wis + 1"
//     },
//     {
//         "name": "Dwarf (Mountain)",
//         "extra": "",
//         "age": "", 
//         "size": "",
//         "speed": "",
//         "special abilities": "",
//         "languages":"",
//         "stats":
//     },

//     {
//         "name": "Eladrin",
//     },
//     {
//         "name": "Elf (Drow)",
//     },
//     {
//         "name": "Elf (Eladrin)",
//     },
//     {
//         "name": "Elf (High)",
//     },
//     {
//         "name": "Elf (Mark of Shadow)",
//     },
//     {
//         "name": "Elf (Sea)",
//     },
//     {
//         "name": "Elf (Shadar-kai)",
//     },
//     {
//         "name": "Elf (Wood)",
//     },
//     {
//         "name": "Fairy",
//     },
//     {
//         "name": "Firbolg",
//     },
//     {
//         "name": "Genasi",
//     },
//     {
//         "name": "Giff",
//     },
//     {
//         "name": "Gith",
//     },
//     {
//         "name": "Githyanki",
//     },
//     {
//         "name": "Githzerai",
//     },
//     {
//         "name": "Gnome",
//     },
//     {
//         "name": "Goblin",
//     },
//     {
//         "name": "Hadozee",
//     },
//     {
//         "name": "Half-Elf",
//     },
//     {
//         "name": "Half-Orc",
//     },
//     {
//         "name": "Halfling",
//     },
//     {
//         "name": "Harengon",
//     },
//     {
//         "name": "Hobgoblin",
//     },
//     {
//         "name": "Hexblood",
//     },
//     {
//         "name": "Human",
//     },
//     {
//         "name": "Kalashtar",
//     },
//     {
//         "name": "Kender",
//     },
//     {
//         "name": "Kenku",
//     },
//     {
//         "name": "Kobold",
//     },
//     {
//         "name": "Leonin",
//     },
//     {
//         "name": "Lizardfolk",
//     },
//     {
//         "name": "Loxodon",
//     },
//     {
//         "name": "Minotaur",
//     },
//     {
//         "name": "Orc",
//     },
//     {
//         "name": "Owlin",
//     },
//     {
//         "name": "Plasmoid",
//     },
//     {
//         "name": "Reborn",
//     },
//     {
//         "name": "Satyr",
//     },
//     {
//         "name": "Sea Elf",
//     },
//     {
//         "name": "Shadar-Kai",
//     },
//     {
//         "name": "Shifter",
//     },
//     {
//         "name": "Tabaxi",
//     },
//     {
//         "name": "Thri-kreen",
//     },
//     {
//         "name": "Tiefling",
//     },
//     {
//         "name": "Tortle",
//     },
//     {
//         "name": "Triton",
//     },
//     {
//         "name": "Vedalken",
//     },
//     {
//         "name": "Verdan",
//     },
//     {
//         "name": "Warforged",
//     },
//     {
//         "name": "Yuan-Ti",
//     },
//     {
//         "name": "Yuan-ti Pureblood",
//     }
// ]

